Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་ཐ་དད་པའི་འདུ་ཤེས་གང་ལས་སེམས་མི་མཉམ་པར་གནས་པར་འགྱུར་བའི་ཐ་དད་པའི་འདུ་ཤེས་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ནམ་མཁའ་བཞིན་དུ་ཞིང་མི་ཟད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཞིང་ཐ་དད་པའི་འདུ་ཤེས་མེད་དོ། ། རང་བཞིན་གྱིས་ཐ་དད་པ་མེད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་སེམས་ཅན་ཐ་དད་པའི་འདུ་ཤེས་མེད་དོ། ། ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་ཅིང་། མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་ཐ་དད་པའི་འདུ་ཤེས་མེད་དོ། ། འདོད་ཆགས་དང་བྲལ་བའི་ཆོས་ཉིད་ཀྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཆོས་ཐ་དད་པའི་འདུ་ཤེས་མེད་དོ། ། དེ་བཞིན་གཤེགས་པ་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པའི་སེམས་ཅན་ལ་ཡང་རྗེས་སུ་ཆགས་པ་མེད། ཚུལ་ཁྲིམས་འཆལ་པ་ལ་ཡང་ཁོང་ཁྲོ་བ་མེད། ཕན་པར་གྱུར་པ་ལ་ཡང་ལན་དུ་ཕན་འདོགས་པ་མེད། གནོད་པར་གྱུར་པ་ལ་ཡང་གནོད་པར་བྱེད་པ་མེད། འདུལ་བར་འོས་པ་ལ་ཡང་མཉམ་པ་ཉིད་དུ་མ་ཡིན། ལོག་པར་ངེས་པའི་སེམས་ཅན་ལ་ཡང་དམོད་པ་མ་ཡིན་གྱི། དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་ཐམས་ཅད་ལ་མཉམ་པར་གནས་ཏེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཐ་དད་པའི་འདུ་ཤེས་མེད་ཅེས་བྱའོ། ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་ཐ་དད་པའི་འདུ་ཤེས་མེད་པ་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐ་དད་པའི་འདུ་ཤེས་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ། འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལྔ་པའོ། །
en: “Moreover, Śāriputra, the Tathāgata does not entertain preferences, which lead to unbalanced states of mind. How so? In the field of the Tathāgata there are no preferences, because his field is imperishable, like space. The Tathāgata has no preferences with regard to sentient beings because they are by nature indistinguishable. There are no preferences in the buddha field of the Tathāgata, because from the perspective of the knowledge of sameness, the totality of phenomena is indivisible. The Tathāgata has no preferences with respect to phenomena, because their actual nature is free from attachment. The Tathāgata does not favor beings who uphold morality, nor does he become angry with the immoral. He does not give benefits to those who provide service, nor does he reject those who act offensively. He is not indifferent to those who are receptive to training, nor does he have contempt for beings immersed in error. The Tathāgata stays balanced in relation to all phenomena, and so it is said that the Tathāgata does not entertain preferences. In this way, the Tathāgata does not entertain preferences, and thus he teaches the Dharma to all sentient beings so that they may eliminate preferences. This is the fifth of his unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ལ་སོ་སོར་མ་བརྟགས་པའི་བཏང་སྙོམས་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་ལམ་བསྒོམས་པའི་ཡིན་ཏེ། ལམ་མ་བསྒོམས་པའི་མ་ཡིན་ནོ། ། དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་སེམས་བསྒོམས་པ་དང་། ཚུལ་ཁྲིམས་བསྒོམས་པ་དང་། ཤེས་རབ་བསྒོམས་པའི་ཡིན་ཏེ། ཤེས་རབ་མ་བསྒོམས་པའི་མ་ཡིན་ནོ། ། དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་ཡེ་ཤེས་དང་ལྡན་པའི་ཡིན་ཏེ། གཏི་མུག་དང་ལྡན་པའི་མ་ཡིན་ནོ། ། དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཡིན་གྱི་འཇིག་རྟེན་པའི་རྣམ་པར་ལྷུང་བ་མ་ཡིན་ནོ། ། དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་འཕགས་པའི་ངེས་པར་འབྱུང་བ་ཡིན་ལ་འཕགས་པའི་མ་ཡིན་པ་ངེས་པར་མི་འབྱུང་བ་མ་ཡིན་ནོ། ། དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་ཚངས་པའི་འཁོར་ལོ་བསྐོར་བ་སྟེ། སེམས་ཅན་ལ་སྙིང་རྗེ་དང་བྲལ་བ་ནི་མ་ཡིན་ནོ། ། དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་ནི་རང་གི་ངང་གིས་གྲུབ་པ་སྟེ། གཉེན་པོའི་རྗེས་སུ་སོང་བ་ནི་མ་ཡིན་ནོ། ། ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་བཏང་སྙོམས་དེ་ནི་མཐོ་བ་ཡང་མ་ཡིན། དམའ་བ་ཡང་མ་ཡིན་ཏེ། མཐོ་དམའ་མེད་པར་གནས་པ་མི་གཡོ་བར་གྱུར་པ། གཉིས་དང་བྲལ་བ། རྟོག་པ་དང་སེལ་བ་ལས་ཤིན་ཏུ་འདས་པ་དུས་ལ་ལྟ་བ་དུས་ལས་མ་ཡོལ་བ། མི་གཡོ་བ། རློམ་སེམས་མེད་པ། མ་བརྟགས་པ། རྣམ་པར་མ་བརྟགས་པ། མ་བསྒོམས་པ། བསྟན་དུ་མེད་པ། ཡང་དག་པ། དེ་ཁོ་ན། དེ་བཞིན་ཉིད། མ་ནོར་བ་དེ་བཞིན་ཉིད། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དེ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟ་བུའི་བཏང་སྙོམས་ཕུན་སུམ་ཚོགས་པས་སེམས་ཅན་ཐམས་ཅད་བཏང་སྙོམས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ། ཤཱ་རིའི་བུ་འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དྲུག་པའོ། །
en: “Moreover, Śāriputra, the equanimity of the Tathāgata is not unconsidered. How so? The equanimity of the Tathāgata is related to the path of cultivation and does not exist without the path of cultivation. The equanimity of the Tathāgata is related to the cultivation of the mind, the cultivation of morality, and the cultivation of wisdom, and it does not exist without the cultivation of wisdom. The equanimity of the Tathāgata is connected with knowledge and does not exist in the presence of confusion. The equanimity of the Tathāgata is otherworldly and does not exist together with involvement in worldly matters. The equanimity of the Tathāgata is conducive to what is noble, and it is not conducive to what is ignoble. The equanimity of the Tathāgata sets the holy wheel in motion and does not abandon compassion for sentient beings. The equanimity of the Tathāgata comes from his own nature, not from that of others. Furthermore, Śāriputra, the equanimity of the Tathāgata is not elated or dejected. It is neither high nor low. It does not rest and is imperturbable. It is free from duality. It is beyond addition and subtraction. It considers the right moment and does not transgress the temporal. It is imperturbable, unconceited, free of mental constructions, undiscriminating, not cultivated, nonconceptual, real, genuine, actual, not false, and not anything different. Such is his perfect equanimity, Śāriputra, and the Tathāgata teaches the Dharma to all sentient beings so that they may attain equanimity. This, Śāriputra, is the sixth of his unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། ། དེ་ལ་འདུན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དགེ་བའི་ཆོས་ལ་འདུན་པའོ། ། དེ་ཡང་གང་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་བྱམས་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། ། སྙིང་རྗེ་ཆེན་པོ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། ། ཆོས་སྟོན་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། ། སེམས་ཅན་འདུལ་བ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། ། རབ་ཏུ་དབེན་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། ། བྱང་ཆུབ་སེམས་དཔར་ཡང་དག་པར་འཛུད་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། ། དཀོན་མཆོག་གསུམ་རྒྱུན་མི་གཅོད་པ་ལ་འདུན་པ་ཉམས་པ་མེད་དོ། ། དེ་བཞིན་གཤེགས་པ་ནི་འདུན་པས་འགྲོ་བ་མ་ཡིན་གྱི། ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བ་སྟེ། འདི་ནི་དེ་བཞིན་གཤེགས་པའི་འདུན་པའོ། ། སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པའི་ཐམས་ཅད་མཁྱེན་པར་འདུན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ། འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བདུན་པའོ། །
en: “Moreover, Śāriputra, the zeal of the Tathāgata is never given up. What is meant by zeal here? It is the zeal for wholesome conduct. What does that imply? It implies that the Tathāgata’s zeal for great love is never given up, his zeal for great compassion is never given up, his zeal to teach the Dharma is never given up, his zeal to train sentient beings is never given up, his zeal to bring sentient beings to maturity is never given up, his zeal for seclusion is never given up, his zeal to encourage others to become bodhisatvas is never given up, and his zeal for the Three Jewels to endure is never given up. The Tathāgata is not driven by zeal; knowledge is foremost. This is the zeal of the Tathāgata, and in order to instill the zeal for unsurpassed omniscience in all sentient beings, he teaches them the Dharma. This is the seventh of his unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་བརྩོན་འགྲུས་ཉམས་པ་མེད་དོ། ། དེ་ལ་དེ་བཞིན་གཤེགས་པའི་བརྩོན་འགྲུས་ནི་འདི་ལྟ་སྟེ། འདུལ་བའི་སེམས་ཅན་ཡལ་བར་མི་འདོར་བའི་བརྩོན་འགྲུས་དང་། ཆོས་ཉན་པ་ལ་བརྙས་པ་མེད་པའི་བརྩོན་འགྲུས་སོ། ། གལ་ཏེ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་སྣོད་ཆོས་ཉན་པ་གང་བསྐལ་པར་ཉན་ཀྱང་སྐྱོ་བར་མི་འགྱུར་བ་དེ་ལྟ་བུ་བརྙེས་ན། དེ་བཞིན་གཤེགས་པ་ཡང་ཆོས་སྟོན་ཅིང་ཞལ་ཟས་དང་བྲལ་བའི་རྒྱུད་ཀྱིས་བསྐལ་པར་ཡང་མི་བཞེངས་སོ། ། དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ལ་ལྟ་བས་ཐ་ན་གང་ན་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་གཅིག་གི་ཕྱིར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདའ་ཞིང་བཞུད་དེ། དེ་བཞིན་གཤེགས་པ་ལ་ལུས་ངལ་བའམ། ངག་ངལ་བའམ། སེམས་ངལ་བ་མེད་དོ། ། དེ་བཞིན་གཤེགས་པ་ནི་ལུས་དང་སེམས་ཤིན་ཏུ་སྦྱངས་པའོ། ། བརྩོན་འགྲུས་བརྩམས་པའོ། ། བརྩོན་འགྲུས་ཀྱི་བསྔགས་པ་གསུང་བ་སྟེ། བརྩོན་འགྲུས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་སྦྱོར་བ་གང་གིས་སེམས་ཅན་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་བའི་བརྩོན་འགྲུས་དེ་སེམས་ཅན་རྣམས་ལ་བསྔགས་པར་མཛད་དེ། ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བརྒྱད་པའོ། །
en: “Moreover, Śāriputra, the vigor of the Tathāgata is never given up. This is what the vigor of the Tathāgata is like. His vigor is such that he never abandons beings who are responsive to training, and his vigor is such that he is never disheartened when he encounters those who wish to hear the Dharma. If the Tathāgata encounters someone who wishes to hear the Dharma, a suitable vessel for the Dharma who has the good fortune of not becoming weary when he hears the Dharma, then the Tathāgata does not turn away from this opportunity but teaches the Dharma continually, with no concern for food. Because of his concern for sentient beings, the Tathāgata will enter as many buddha fields as there are grains of sand of the river Ganges, and wherever there are beings to be trained by the Buddha, even just one, the Tathāgata will not display any sign of fatigue in body, speech, or mind. The Tathāgata remains serene in body, speech, and mind. He engages with vigor. He speaks highly of vigor. Through genuinely engaging with vigor, sentient beings will attain noble liberation, and it is that vigor that he extols to sentient beings. This, Śāriputra, is the eighth of his unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་དྲན་པ་ཉམས་པ་མེད་ཅིང་དེ་བཞིན་གཤེགས་པའི་དྲན་པ་ནི་བསྙེལ་བ་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་དེ་བཞིན་གཤེགས་པ་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་མ་ཐག་ཏུ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་གྱི་སེམས་ཅན་གྱི་སེམས་ཀྱི་རྒྱུད་ལ་རྣམ་པར་བལྟས་ཀྱང་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱིས་ཤིན་ཏུ་དྲན་པ་བསྙེལ་བ་མེད་དོ། ། སེམས་ཅན་གྱི་སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་ཀྱང་དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཕྱིས་གཏང་བར་བྱ་བ་མེད་དོ། ། ཕུང་པོ་གསུམ་དུ་རྣམ་པར་གཞག་པ་དང་། སེམས་ཅན་གྱི་དབང་པོ་ལ་འཇུག་པ་དང་། སེམས་ཅན་གྱི་བསམ་པ་ལ་འཇུག་པ་དང་། སེམས་ཅན་གྱི་སྤྱོད་པ་རྣམ་པར་ལྟ་བས་དེ་བཞིན་གཤེགས་པའི་དྲན་པ་ལ་ཡོངས་སུ་ཉམས་པ་མེད་དོ། ། དེ་བཞིན་གཤེགས་པའི་དྲན་པ་ནི་དྲན་པར་བྱ་བ་དང་། བསམ་པར་བྱ་བ་དང་བརྟག་པར་བྱ་བ་མེད་ཀྱང་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་འབྲི་བར་མི་འགྱུར་རོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེའི་དྲན་པ་ལ་ཉམས་པ་མེད་དོ། ། དེ་ཇི་ལྟར་དྲན་པས་བདག་དྲན་ཞིང་མི་བརྗེད་པ་དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དགུ་པའོ། །
en: “Moreover, Śāriputra, the Tathāgata’s awareness of all things in all ways and of all things at all times is never given up, because the Tathāgata’s awareness is free from distraction. How so? The moment the perfectly awakened Tathāgata became an unsurpassed, fully accomplished buddha, he could see the mindstreams of all sentient beings in the past, future, and present, and from the moment of his awakening, the awareness of the Tathāgata has never been distracted. The knowledge of the Tathāgata, by which he knows the ways of sentient beings, will not be lost. The Tathāgata does not lose his awareness of the conduct of sentient beings in relation to the three types of sentient beings, their acquisition of their faculties, and the states of mind that motivate them. As he teaches the Dharma to sentient beings, the Tathāgata does not need to employ his awareness to recollect, contemplate, or analyze. He makes no mistakes. How can that be? It is because there is no deterioration in his awareness. Self-aware and undistracted, he teaches the Dharma to sentient beings. This, Śāriputra, is the ninth of the Tathāgata’s unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཉམས་པ་མེད་དོ། ། གང་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་དེ་ནི་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དེ། ཆོས་ཐམས་ཅད་མི་མཉམ་པ་མ་ཡིན་ནོ། ། ཆོས་ཐམས་ཅད་ནི་ཇི་ལྟ་བ་བཞིན་པའོ། ། ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་ལས་མི་ཉམས་ཞེ་ན། དེ་བཞིན་ཉིད་གང་དང་མཉམ་པ་ཏིང་ངེ་འཛིན་ཀྱང་དེ་དང་མཉམ་མོ། ། ཏིང་ངེ་འཛིན་གང་དང་མཉམ་པ་དེ་བཞིན་ཉིད་ཀྱང་དེ་དང་མཉམ་སྟེ། མཉམ་པ་ཉིད་དེ་ལ་ཞུགས་པས་དེའི་ཕྱིར་མཉམ་པ་ཞེས་བྱའོ། ། འདོད་ཆགས་ཀྱི་མཐའ་གང་དང་མཉམ་པ་འདོད་ཆགས་མེད་པའི་མཐའ་ཡང་དེ་དང་མཉམ་མོ། ། ཞེ་སྡང་གི་མཐའ་གང་དང་མཉམ་པ་ཞེ་སྡང་མེད་པའི་མཐའ་ཡང་དེ་དང་མཉམ་མོ། གཏི་མུག་གི་མཐའ་གང་དང་མཉམ་པ་གཏི་མུག་མེད་པའི་མཐའ་ཡང་དེ་དང་མཉམ་མོ། ། འདུས་བྱས་ཀྱི་མཐའ་གང་དང་མཉམ་པ་འདུས་མ་བྱས་ཀྱི་མཐའ་ཡང་དེ་དང་མཉམ་མོ། ། འཁོར་བའི་མཐའ་གང་དང་མཉམ་པ་མྱ་ངན་ལས་འདས་པའི་མཐའ་ཡང་དེ་དང་མཉམ་མོ། ། མཉམ་པ་ཉིད་དེ་ལ་སྙོམས་པར་ཞུགས་པས་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཉམས་པ་མེད་ཅེས་བྱའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། མཉམ་པ་ཉིད་མི་ཉམས། ཡོངས་སུ་མི་ཉམས་སོ། ། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་དེ་ཡང་མིག་དང་ལྡན་པ་མ་ཡིན། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་དང་ལྡན་པ་མ་ཡིན་མོད་ཀྱི། དེ་བཞིན་གཤེགས་པ་དབང་པོ་མ་ཚང་བ་ཡང་མ་ཡིན་ནོ། ། ཏིང་ངེ་འཛིན་ནི་སའི་ཁམས་ལ་མི་གནས། ཆུ་དང་། མེ་དང་། རླུང་གི་ཁམས་ལ་མི་གནས། འདོད་པ་དང་། གཟུགས་དང་། གཟུགས་མེད་པའི་ཁམས་ལ་མི་གནས་འཇིག་རྟེན་ཕ་རོལ་ལ་མི་གནས་ཏེ། མི་གནས་པས་ན་ཉམས་པ་མེད་དོ། ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཉམས་པ་མེད་དེ། སེམས་ཅན་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་རྙེད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅུ་པའོ། །
en: “Moreover, Śāriputra, the concentration of the Tathāgata is never given up. The concentration of the Tathāgata is the sameness of all phenomena. It is the absence of any differences between phenomena. It is endowed with the actual nature of all phenomena. Why does the Tathāgata not lose his concentration? Whatever suchness is, that is what his concentration is like. Whatever his concentration is like, that is what suchness is. He rests in this sameness, and that is why he is ‘concentrated.’ The sameness of the very peak of attachment is the sameness of the very peak of nonattachment. The sameness of the very peak of anger is the sameness of the very peak of the absence of anger. The sameness of the very peak of confusion is the sameness of the very peak of the absence of confusion. The sameness of the very peak of the conditioned is the sameness of the very peak of the unconditioned. The sameness of the very peak of saṃsāra is the sameness of the very peak of nirvāṇa. He actualizes this sameness, and that is why it is said that there is no deterioration in the concentration of the Tathāgata. How can that be? It is because his sameness is never given up; it is not corrupted. Further, although the concentration of the Tathāgata is not dependent on the eye and not dependent on the ear, the nose, the tongue, the body, or the mind, the Tathāgata does not lack faculties. His concentration is not reliant on the earth element. It is not reliant on the water, fire, or wind element. It is not reliant on the realm of desire, form, or formlessness. It is not reliant on this world, and it is not reliant on the world beyond. As it is not reliant on anything, it is never given up. Therefore, as the Tathāgata’s concentration is never given up, he teaches the Dharma to all sentient beings in order that they may achieve this concentration. This, Śāriputra, is the tenth of the Tathāgata’s unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་ཉམས་པ་མེད་དོ། ། དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་གང་ཞེ་ན། གང་ཆོས་ཐམས་ཅད་རབ་ཏུ་ཤེས་པ་སྟེ། གཞན་གྱི་དྲིང་མི་འཇོག་པའི་ཤེས་པའོ། ། སེམས་ཅན་གཞན་རྣམས་དང་། གང་ཟག་གཞན་དག་ལ་ཆོས་གོ་བར་བྱེད་པའི་ཤེས་པའོ། ། སོ་སོ་ཡང་དག་པར་རིག་པ་མི་ཟད་པ་ལ་མཁས་པའི་ཤེས་པའོ། ། ཚིག་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བ་ཤེས་པའོ། ། ཚིག་གཅིག་ལ་འཇུག་པས་བསྐལ་པ་བརྒྱ་སྟོང་དུ་མི་ཆད་པར་སྟོན་པ་ཤེས་པའོ། ། ཇི་ལྟ་བུ་ཅི་འདྲ་ཞེས་དྲིས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཐེ་ཚོམ་གཅོད་པའི་ཤེས་པའོ། ། ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པའི་ཤེས་པའོ། ། ཐེག་པ་གསུམ་རྣམ་པར་དགོད་པ་བསྟན་པ་ཤེས་པའོ། ། སེམས་ཅན་གྱི་སེམས་ཀྱི་སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོངས་སུ་ཤེས་པའི་ཤེས་པའོ། ། ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཅི་རིགས་པར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ཤེས་པའོ། ། འདི་ནི་ཤེས་རབ་མི་ཟད་པ་བསྟན་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་མཐའ་ཡས་མུ་མེད་ཟད་མི་ཤེས་པའོ། ། གང་གི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་ཉམས་པ་མེད་པ་དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱི་ཤེས་རབ་ཀྱང་མི་ཟད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ། ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅུ་གཅིག་པའོ། །
en: “Moreover, Śāriputra, the wisdom of the Tathāgata is never given up. What is the wisdom of the Tathāgata? It is a full understanding of all phenomena. It is a knowledge that is unaffected by others. It is a knowledge that is able to make things clear for other sentient beings, for other people. It is a knowledge that comes from skill in detailed, nondual analysis. It is a knowledge that understands everything that is said. It is a knowledge that, by employing a single expression, is able to continue teaching for a hundred thousand eons. It is a knowledge that can alleviate the doubts that come from such questions as ‘how’ or ‘why.’ It is a knowledge that is always unimpeded. It is a knowledge that teaches by assigning one to whichever of the three vehicles is appropriate. It is a knowledge that comprehends sentient beings’ eighty-four thousand kinds of mental activity. It is a knowledge that can assign what is appropriate among the eighty-four thousand categories of teaching. This understanding of the Tathāgata is boundless and imperishable because his teaching with wisdom is imperishable. Therefore, the wisdom of the Tathāgata is never given up, and he thus teaches the Dharma to sentient beings so that they may attain imperishable wisdom. This, Śāriputra, is the eleventh of his unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བ་ཉམས་པ་མེད་དོ། ། དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གྲོལ་བ་གང་ཞེ་ན། ཉན་ཐོས་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བ་ནི་སྒྲའི་རྗེས་སུ་འགྲོ་བའོ། ། རང་སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བ་ནི་རྐྱེན་ཁོང་དུ་ཆུད་པའོ། ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རྣམ་པར་གྲོལ་བ་ནི་ཆགས་པ་དང་། གཉིས་སུ་འཛིན་པ་ཐམས་ཅད་དང་བྲལ་བས་རྣམ་པར་གྲོལ་བ་ཞེས་བྱ་སྟེ། སྔོན་གྱི་མཐར་ཡང་མ་བཅིངས། ཕྱི་མའི་མཐར་ཡང་མི་འཕོ། ད་ལྟར་བྱུང་བ་ལ་ཡང་མི་གནས་ཏེ། མིག་དང་གཟུགས་ལ་གཉིས་སུ་འཛིན་པ་ལས་རྣམ་པར་གྲོལ་བའོ། ། དེ་བཞིན་དུ་རྣ་བ་དང་། སྒྲ་དང་། སྣ་དང་། དྲི་དང་། ལྕེ་དང་། རོ་དང་། ལུས་དང་། རེག་བྱ་ལ་གཉིས་སུ་འཛིན་པ་ལས་རྣམ་པར་གྲོལ་བ་སྟེ། མི་འཛིན། མངོན་པར་མི་ཆགས་པར་གནས་པའི་རྣམ་པར་གྲོལ་བའོ། ། སེམས་རང་བཞིན་གྱིས་འོད་གསལ་བ་དེ་བཞིན་དུ་ཤེས་པས་དེ་དེའི་ཕྱིར་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཞེས་བྱའོ། ། ཇི་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅུ་གཉིས་པའོ། །
en: “Moreover, Śāriputra, the liberation of the Tathāgata is never given up. What is the liberation of the Tathāgata? The liberation of the śrāvakas lies in the fact that they follow only verbal expressions. The liberation of the pratyekabuddhas comes from their contemplation of conditions. The liberation of the lords, the buddhas, is their freedom from all sorts of clinging and ideas of duality. Liberation implies that one is not bound from the outset, one does not continue at the end, and one does not remain in one’s present state. It is freedom from grasping at the duality of eye and form. In the same way, it is freedom from grasping at the dualities of ear and sound, of nose and smell, of tongue and taste, and of body and physical objects. It is a liberation that is based on the absence of grasping and the absence of attachment. Knowledge is the natural luminosity of the mind, and that is why it is said that the wisdom inherent in a single moment of thought can lead to the realization of unsurpassed perfect awakening. As he is perfectly awakened, the Tathāgata teaches the Dharma to sentient beings. This, Śāriputra, is the twelfth of the Tathāgata’s unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ལུས་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་ངོ་། ། ལུས་ཀྱི་ལས་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་གཟིགས་པས་ཀྱང་སེམས་ཅན་འདུལ། གསུང་བས་ཀྱང་སེམས་ཅན་འདུལ། ཅང་མི་གསུང་བས་ཀྱང་སེམས་ཅན་འདུལ། བཤོས་གསོལ་བས་ཀྱང་སེམས་ཅན་འདུལ། སྤྱོད་ལམ་གྱིས་ཀྱང་སེམས་ཅན་འདུལ། མཚན་གྱིས་ཀྱང་སེམས་ཅན་འདུལ། དཔེ་བྱད་བཟང་པོས་ཀྱང་སེམས་ཅན་འདུལ། གཙུག་ཏོར་བལྟར་མི་སྣང་བ་དང་། བལྟས་པ་ཙམ་དང་། འོད་གཏོང་བ་དང་། གོམ་པ་འདོར་བ་དང་། འཇོག་པ་དང་། གྲོང་ཁྱེར་དུ་འཇུག་པ་དང་། འབྱུང་བས་ཀྱང་སེམས་ཅན་འདུལ་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱོད་ལམ་གང་གིས་ཀྱང་སེམས་ཅན་འདུལ་བར་མི་འགྱུར་བ་མེད་དོ། ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ལུས་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་ཞེས་བྱ་སྟེ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅུ་གསུམ་པའོ། །
en: “Moreover, Śāriputra, all the Tathāgata’s bodily activity is preceded by knowledge and accompanied by knowledge. The Tathāgata trains sentient beings by performing certain bodily activities. He trains sentient beings by speaking. He trains sentient beings by remaining silent. He trains sentient beings by consuming food. He trains sentient beings by means of his spiritual practice. He trains sentient beings by means of the major characteristics. He trains sentient beings by means of the minor marks. He trains sentient beings by means of his invisible crown protrusion, by just being seen, by emitting radiance, by walking in a certain manner, and by entering and leaving towns. There is nothing in the conduct of the Lord Buddha that does not lead to sentient beings being trained. Therefore, it is said that all the Tathāgata’s bodily activity is preceded by knowledge and accompanied by knowledge. This, Śāriputra, is the thirteenth of the Tathāgata’s unique buddha qualities.
